Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: The actual random order is subject to change in future versions of Perl, but it is guaranteed to be the same order as either the C<keys> or C<each> function would produce on the same (unmodified) hash.
es_es: El actual orden aleatorio está sujeto a cambio en futuras versiones de Perl, pero se garantiza que sea el mismo orden que las funciones C<keys> o C<each> producirían (mientras que el hash no haya sido modificado).

source: The following modules and pragmata have been updated since Perl 5.8.1:
es_es: Los siguientes módulos y pragmata se han actualizado desde Perl 5.8.1:

source: =item exec PROGRAM LIST
es_es: =item exec PROGRAMA LISTA

source: C<--compat-version> argument checking has been improved
es_es: La comprobación de argumentos de C<--compat-version> ha sido mejorada

source: This document describes various features of Linux that will affect how Perl version 5 (hereafter just Perl) is compiled and/or runs.
es_es: Este documentos describe varias características de Linux que afectarán a cómo Perl versión 5 (de ahora en adelante sólo Perl) es compilado y/o ejecutado.

source: You may no longer invoke the set uid perl directly, so to preserve backwards compatibility with scripts that invoke #!/usr/bin/suidperl the only set uid binary is now C<sperl5.8.>I<n> (C<sperl5.8.4> for this release).
es_es: Es posible que ya no invoque a perl con el uid activado, directamente, así que para mantener la compatibilidad anterior con I<scripts> que llaman a #!/usr/bin/suidperl el único binario con uid activado es ahora C<sperl5.8.>I<n> (C<sperl5.8.4> para esta versión).

source: The following modules and pragmata have been updated since Perl 5.8.0:
es_es: Los siguientes módulos y pragmata se han actualizado desde Perl 5.8.0:

source: # Retrieve $x, $y, ...
es_es: # Recupera $x, $y, ...

source: If you read this file _as_is_, just ignore the funny characters you see.
es_es: Si lees este archivo _tal_como_es_, ignora los caracteres curiosos que veas.

source: That is, with this modifier, C<\d> always means precisely the digits C<"0"> to C<"9">; C<\s> means the five characters C<[ \f\n\r\t]>; C<\w> means the 63 characters C<[A-Za-z0-9_]>; and likewise, all the Posix classes such as C<[[:print:]]> match only the appropriate ASCII-range characters.
es_es: Es decir, con esta modificación, C<\d> siempre representa exactamente a los dígitos C<"0"> a C<"9">; C<\s> representa a los cinco caracteres C<[ \f\n\r\t]>; C<\w> representa a los 63 caracteres C<[A-Za-z0-9_]>; y, del mismo modo, todas las clases Posix, como C<[[:print:]]> solo coinciden con el rango apropiado de caracteres ASCII.

source: If not, the pointer to the string value is passed.
es_es: Si no, se pasa el puntero al valor de la cadena.

source: It returns the child pid to the parent process, C<0> to the child process, or C<undef> if the fork is unsuccessful.
es_es: Devuelve el pid del hijo al proceso padre, C<0> al proceso hijo, o C<undef> si no se consiguió el fork.

source: Perl now builds on OpenVMS I64
es_es: Perl ahora se compila en OpenVMS I64

source: Single quotes indicate the text is to be treated literally with no interpolation of its content.
es_es: Las comillas simples indican que el texto se va a tratar literalmente, sin interpolación de su contenido.

source: The operation of interpolation should not be confused with the operation of matching a backreference.
es_es: La operación de interpolación no se debe confundir con la operación de coincidencia con una contrareferencia.

source: =head2 Build
es_es: =head2 Compilación

source: B<NOTE:> While the notation of this construct is the same as the similar function in .NET regexes, the behavior is not.
es_es: B<NOTA:> Si bien la notación de esta construcción es la misma que la función similar en las expresiones regulares en .NET, el comportamiento no lo es.

source: That is, modifying an element of a list returned by sort() (for example, in a C<foreach>, C<map> or C<grep>) actually modifies the element in the original list.
es_es: Es decir, modificar un elemento de la lista devuelto por grep (por ejemplo, en un C<foreach>, C<map> o C<grep>) modifica el elemento en la lista original.

source: A test that looks at such stringification thus doesn't need to have the system default flags hard-coded in it, just the caret.
es_es: Una prueba que examina esta conversión a cadena de caracteres no tiene por qué tener las banderas por defecto del sistema puesta en el propio código, sólo el circunflejo.

source: (But in practice, the distinction between code point and character is blurred, so the terms often are used interchangeably.)
es_es: (en la práctica, la distinción entre los conceptos de código de carácter y carácter es difusa, por lo que se suelen utilizar ambos términos indistintamente).

source: "no VERSION" will now correctly deparse with B::Deparse, as will certain constant expressions.
es_es: "no VERSION" será ahora correctamente decompilado con B::Deparse, así como ciertas expresiones constantes.

source: %D a synonym for %ld
es_es: %D un sinónimo para %ld

source: If using crypt() on a Unicode string (which I<potentially> has characters with codepoints above 255), Perl tries to make sense of the situation by trying to downgrade (a copy of) the string back to an eight-bit byte string before calling crypt() (on that copy).
es_es: Si usa crypt() en una cadena Unicode (que I<potencialmente> tiene caracteres con codificación superior al 255), Perl intenta darle sentido a la situación intentando hacer una degradación (una copia) de la cadena a una cadena de bytes antes de llamar a crypt() (sobre esa copia).

source: Thus,
es_es: Por lo tanto,

source: There are also many Perl books available, covering a wide variety of topics, from various publishers.
es_es: También hay muchos libros disponibles en Perl, que cubren una amplia variedad de temas, de diversos editores.

source: You are allowed to use underscores (underbars) in numeric literals between digits for legibility.
es_es: Está permitido el uso de guiones bajos en literales numéricos entre los dígitos para aumentar la legibilidad.

source: They often work the same, but see L<perltrap> for information about how they differ.
es_es: A menudo funcionan de la misma forma, pero mire L<perltrap> para ver cómo difieren.

source: "-Dusedevel" may be required to configure Perl 5.7.2 non-interactively.
es_es: "-Dusedevel" puede ser necesario para configurar Perl 5.7.2 de forma no interactiva.

source: =head1 Core Enhancements
es_es: =head1 Mejoras del núcleo

source: Sets FILEHANDLE's system position in bytes using lseek(2).
es_es: Establece la posición del IDENTIFICADOR_ARCHIVO en bytes usando lseek(2).

source: Various bug fixes
es_es: Varios errores corregidos

source: =item select RBITS,WBITS,EBITS,TIMEOUT X<select>
es_es: =item select RBITS,WBITS,EBITS,TIEMPO_ESPERA X<select>

source: (See L<perlsyn/"Compound Statements">.) You can refer to them by absolute number (using C<"$1"> instead of C<"\g1">, etc); or by name via the C<%+> hash, using C<"$+{I<name>}">.
es_es: (Vea L<perlsyn/"Instrucciones complejas">.) Puede referirse a ellos con un número absoluto (usando C<"$1"> en lugar de C<"\g1">, etc); o por nombre vía el hash C<%+>, usando C<"$+{I<nombre>}">.

source: You can control which DBM library you use by loading that library before you call dbmopen():
es_es: Puede controlar qué biblioteca DBM usará cargando la biblioteca antes de llamar a dbmopen():

source: This is the internal function implementing the C<< <*.c> >> operator, but you can use it directly.
es_es: Esto es la función interna que implementa el operador C<< <*.c> >>, pero puede usarla directamente.

source: There is a very large user community and an extensive literature.
es_es: Tiene una gran comunidad de usuarios y existe mucha información sobre el lenguaje.

source: From now on all applications embedding perl will behave as if perl were compiled with -DPERL_USE_SAFE_PUTENV.
es_es: A partir de ahora todas las aplicaciones que incrusten perl se comportarán como si se estuviera compilado con -DPERL_USE_SAFE_PUTENV.

source: It's easy to program Unicode capable software, but it does require discipline to do it right.
es_es: Es fácil programar software compatible con Unicode, pero hacerlo bien requiere disciplina.

source: Where do I post questions?
es_es: ¿Dónde puedo publicar preguntas?

source: Work will continue on the bytecompiler and byteloader.
es_es: Se seguirá trabajando en el bytecompiler y byteloader.

source: print $out $record;
es_es: print $salida $registro;

source: The generalized form of backticks is C<qx//>.
es_es: La forma generalizada de las comillas invertidas es C<qx//>.

source: In general, use C<"\n"> when you mean a "newline" for your system, but use the literal ASCII when you need an exact character.
es_es: En general, utilice C<"\n"> cuando se refiera a una "nueva línea" para su sistema, pero use el literal ASCII cuando necesite un carácter exacto.

source: Processing of C<\Q>, C<\U>, C<\u>, C<\L>, C<\l>, C<\E>, and interpolation happens (almost) as with C<qq//> constructs.
es_es: El procesamiento de C<\Q>, C<\U>, C<\u>, C<\L>, C<\l>, C<\E> e interpolación ocurre (casi) como en las construcciones C<qq//>.

source: Note that the value is parsed every time the C<eval> executes.
es_es: Note que el valor es interpretado cada vez que se ejecuta C<eval>.

source: It does not even aim to be entirely accurate.
es_es: Tampoco explica el lenguaje en detalle.

source: # reset line numbering on each input file
es_es: # reiniciar el numerado de líneas en cada archivo de entrada

source: Apart from resetting the iterator, C<values @array> in list context is the same as plain C<@array>.
es_es: Además de restablecer el iterador, C<values @array> en contexto lista es la mismo que un simple C<@array>.

source: This directory contains dual-life modules where the CPAN module is canonical.
es_es: Este directorio contiene módulos de evolución dual en los que el módulo de CPAN es la versión canónica.

source: printf '<%.0f>', 1; # prints "<1>"
es_es: printf '<%.0f>', 1; # imprime "<1>"

source: $re = qr{ ( # paren group 1 (full function) foo ( # paren group 2 (parens) \( ( # paren group 3 (contents of parens) (?: (?> [^()]+ ) # Non-parens without backtracking | (?2) # Recurse to start of paren group 2 )* ) \) ) ) }x;
es_es: $re = qr{ ( # paréntesis grupo 1 (toda la función) foo ( # paréntesis grupo 2 (paréntesis) \( ( # paréntesis grupo 3 (contenidos de paréntesis) (?: (?> [^()]+ ) # No-paréntesis sin retroceso | (?2) # Recursivo para empezar el paréntesis grupo 2 )* ) \) ) ) }x;

source: DO \S, \W and \D negate
es_es: CORRECTO \S, \W y \D negación

source: Thus:
es_es: Por lo tanto:

source: It's more convenient than writing out the individual elements as a list of separate scalar values.
es_es: Es más conveniente que escribir los elementos individuales como una lista de valores escalares separados.

source: Traditionally the result is a string of 13 bytes: two first bytes of the salt, followed by 11 bytes from the set C<[./0-9A-Za-z]>, and only the first eight bytes of PLAINTEXT mattered.
es_es: Tradicionalmente, el resultado es una cadena de 13 bytes: los dos primeros son el salto, seguido de 11 bytes del conjunto C<[./0-9A-Za-z]>, y sólo los primeros ocho bytes del I<digest> interesan.

source: And it's faster because Perl executes a C<foreach> statement more rapidly than it would the equivalent C<for> loop.
es_es: Y es más rápido porque Perl ejecuta una instrucción C<foreach> más rápidamente que su equivalente en un bucle C<for>.

source: =head2 Another Example: Key is a C int.
es_es: =head2 Otro ejemplo: las claves son enteros de C

source: This form, known as v-strings, provides an alternative, more readable way to construct strings, rather than use the somewhat less readable interpolation form C<"\x{1}\x{14}\x{12c}\x{fa0}">.
es_es: Esta forma, conocida como "v-strings", ofrece una alternativa, más legible, para construir cadenas, en lugar de una forma de interpolación mucho menos legible como C<"\x{1}\x{14}\x{12c}\x{fa0}">.

source: If you are upgrading from an earlier release such as 5.12.1, first read L<perl5122delta>, which describes differences between 5.12.1 and 5.12.2.
es_es: Si está actualizando desde una versión anterior como la 5.12.1, primero lea L<perl5122delta>, que describe las diferencias entre 5.12.1 y la 5.12.2.

source: =item Bitwise operators during C<use integer>
es_es: =item Operadores bit a bit con C<use integer> activo

source: Don't rely on it.
es_es: No confíe en él.

source: 1 minor bug fix for Win32
es_es: 1 error menor arreglado para Win32

source: The important difference between them is that test 3 contains a quantifier (C<\D*>) and so can use backtracking, whereas test 1 will not.
es_es: La diferencia importante entre ellos es que el test 3 contiene un cuantificador (C<\D*>) y por lo tanto puede utilizar la marcha atrás, mientras que el test 1, no.

source: =item splice ARRAY or EXPR,OFFSET
es_es: =item splice ARRAY o EXPR,DESPLAZAMIENTO

source: || die "can't open < $file: $!";
es_es: || die "no puedo abrir < $archivo: $!";

source: or die "Can't open 'foo' for input: $!";
es_es: or die "No puedo abrir 'foo' para entrada: $!";

source: # These do the print before evaluating exit:
es_es: # Esto llama al print antes de evaluar exit:

source: Sometimes minimal matching can help a lot.
es_es: A veces una coincidencia mínima puede ayudar un montón.

source: Variable names are recognized as intended
es_es: Los nombres de variables se reconocen según lo previsto

source: You can specify a series of alternatives for a pattern using "|" to separate them, so that C<fee|fie|foe> will match any of "fee", "fie", or "foe" in the target string (as would C<f(e|i|o)e>).
es_es: Puede especificar una serie de alternativas para un patrón usando "|" para separarlos, por lo que C<fee|fie|foe> coincide con cualquier "fee", "fie", o "foe" en la cadena objetivo (al igual que C<f(e|i|o)e>).

source: We have a backlog of unresolved bugs.
es_es: Tenemos un retraso de errores sin resolver.

source: Jarkko Hietaniemi and Andy Lester worked to mark as much data as possible in the C source files as C<static>, to increase the proportion of the executable file that the operating system can share between process, and thus reduce real memory usage on multi-user systems.
es_es: Jarkko Hietaniemi y Andy Lester trabajaron para marcar como C<static> la mayor cantidad de datos en los archivos de código fuente en C, para incrementar la proporción del archivo ejecutable que el sistema operativo puede compartir entre procesos, y reducir así la cantidad de memoria utilizada en sistemas multiusuario.

source: The C<foreach> modifier is an iterator: it executes the statement once for each item in the LIST (with C<$_> aliased to each item in turn).
es_es: El modificador C<foreach> es un iterador: ejecuta la instrucción una vez por cada elemento en la LISTA (con C<$_> asociado a cada elemento en cada iteración).

source: See L<Exporter>.
es_es: Ver L<Exporter>.

source: Slavish adherence to portability concerns shouldn't get in the way of your getting your job done.)
es_es: Adhesión servil a los requerimientos de portabilidad no debe impedirle obtener el trabajo hecho).

source: OPEN this, mode, LIST
es_es: OPEN este, modo, LISTA

source: This was once used in a common idiom to disable or quote the special meanings of regular expression metacharacters in a string that you want to use for a pattern.
es_es: Esto se usó una vez como un modismo común para desactivar o citar los significados especiales de los metacaracteres de expresiones regulares en una cadena que desea utilizar para un patrón.

source: An example disabling Nagle's algorithm on a socket:
es_es: Un ejemplo para deshabilitar el algoritmo de Nagle del socket:

source: my $line = <$in>;
es_es: my $linea = <$entrada>;

source: This document describes differences between the 5.12.0 release and the 5.13.0 release.
es_es: Este documento describe las diferencias entre la versión 5.12.0 y la versión 5.13.0.

source: =item link OLDFILE,NEWFILE X<link>
es_es: =item link ARCHIVO_VIEJO,ARCHIVO_NUEVO X<link>

source: @a = qw/first second third/;
es_es: @a = qw/primero segundo tercero/;

source: Those functions ignore the buffering, while tell() does not.
es_es: Esas funciones ignoran el sistema de búfer, mientras que tell(), no.

source: + addition
es_es: + suma

source: The syntax error will be reported close to the C<}>, but you'll need to change something near the C<{> such as using a unary C<+> to give Perl some help:
es_es: El error de sintaxis será reportado cerca de C<}>, pero tendrá que cambiar algo cerca de C<{>, como en el uso de un unario C<+>, para darle un poco de ayuda a Perl:

source: When verifying an existing digest string you should use the digest as the salt (like C<crypt($plain, $digest) eq $digest>).
es_es: Cuando verifique un string i<digest> debe usar el propio I<digest> como el salto (como C<crypt($plano, $digest) eq $digest>).

source: perlvar - Perl predefined variables
es_es: perlvar Variables predefinidas

source: (at least in platforms of ASCII progeny) Perl 5.8.1 restores the more natural interpretation
es_es: (al menos en las plataformas de la progenie ASCII). Perl 5.8.1 restauró la interpretación más natural

source: =head2 Tied Arrays with Negative Array Indices
es_es: =head2 Arrays enlazados con índices de array negativos

source: print ++$j; # prints 1
es_es: print ++$j; # imprime 1

source: perl5101delta Perl changes in version 5.10.1
es_es: perl5101delta Cambios en la versión 5.10.1

source: If no C<import> method can be found then the call is skipped, even if there is an AUTOLOAD method.
es_es: Si no se puede encontrar ningún método C<import> entonces la llamada se pasa por alto, incluso si hay un método AUTOLOAD.

source: $old_filter = $db->filter_store_key ( sub { ... } );
es_es: $filtro_antiguo = $db->filter_store_key ( sub { ... } );

source: will be treated as a boolean match because the rules say both a regex match and an explicit test on $_ will be treated as boolean.
es_es: será tratado como una coincidencia booleana porque las reglas dicen que tanto una expresión regular de una coincidencia y una prueba explícita sobre $_ serán tratados como booleanos.

source: (?: (?<= ^ ) | (?<= \s ) ) # after start-of-string or whitespace
es_es: (?: (?<= ^ ) | (?<= \s ) ) # después de inicio-de-cadena o espacio en blanco

source: This feature can be extremely useful to give perl hints about where it shouldn't backtrack.
es_es: Esta característica puede ser muy útil para dar pistas a perl sobre dónde no debe dar marcha atrás.

source: Hash Array hash keys intersection grep { exists $a->{$_} } @$b
es_es: Hash Array claves hash intersección grep { exists $a->{$_} } @$b

source: LINE: while (defined($line = <ARGV>)) {
es_es: LINEA: while (defined($linea = <ARGV>)) {

source: nonassoc == != <=> eq ne cmp ~~
es_es: no asoc. == != <=> eq ne cmp ~~

source: { exec ('foo') }; print STDERR "couldn't exec foo: $!";
es_es: { exec ('foo') }; print STDERR "no puedo exec foo: $!";

source: (This way C<~~> will not break encapsulation by matching against the object's internal representation as a reference.)
es_es: (De esta forma C<~~> no romperá la encapsulación al hacer la comparación con la representación interna del objeto a través de la referencia.)

source: If the file is successfully compiled, C<do> returns the value of the last expression evaluated.
es_es: Si el archivo se compila bien, C<do> devuelve el valor de la última expresión evaluada.

source: =item sqrt EXPR X<sqrt> X<root> X<square root>
es_es: =item sqrt EXPR X<sqrt> X<root> X<square root> X<raíz cuadrada>

source: ($nfound,$timeleft) =
es_es: ($n_encontrados,$tiempo_restanto) =

source: But with C<< open(A, ">>&=B") >>, the filehandles will share the same underlying system file descriptor.
es_es: Pero con C<< open(A, ">>&=B") >>, los identificadores de archivo compartirán el mismo descriptor de archivo subyacente.

source: Sets and returns the random number seed for the C<rand> operator.
es_es: Establece y devuelve la semilla de números aleatorios para el operador C<rand>.

source: $pattern =~ s/(\W)/\\$1/g;
es_es: $patrón =~ s/(\W)/\\$1/g;

source: Prints a string or a list of strings.
es_es: Imprime una cadena o una lista de cadenas.

source: Thus Perl provides the "possessive" quantifier form as well.
es_es: Así, Perl proporciona también el cuantificador "posesivo".

source: =head2 List assignment to %ENV works
es_es: =head2 La asignación de lista a %ENV funciona

source: comp.lang.perl.modules Use and development of Perl modules
es_es: comp.lang.perl.modules Uso y desarrollo de módulos Perl

source: The embedding examples of L<perlembed> have been reviewed to be up to date and consistent: for example, the correct use of PERL_SYS_INIT3() and PERL_SYS_TERM().
es_es: Los ejemplos incluidos en L<perlembed> han sido revisados para estar al día y ser consistentes: por ejemplo, el uso correcto de PERL_SYS_INIT3() y PERL_SYS_TERM().

source: As shown in this example, C<goto-EXPR> is exempt from the "looks like a function" rule.
es_es: Como se muestra en este ejemplo, C<goto-EXPR> está exento de la regla "se parece a una función".

source: THIS PACKAGE IS PROVIDED "AS IS" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
es_es: ESTE PAQUETE SE PROPORCIONAL "TAL CUAL" Y SIN NINGUNA GARANTÍA EXPRESA O IMPLÍCITA, INCLUYENDO, SIN LIMITACIÓN, LAS GARANTÍAS IMPLÍCITAS DE COMERCIALIDAD E IDONEIDAD PARA UN PROPÓSITO PARTICULAR.

source: Or:
es_es: o:

source: =item getnetbyaddr ADDR,ADDRTYPE
es_es: =item getnetbyaddr DIRECCIÓN,TIPODIR

source: As an example, the following code waits on semaphore $semnum of semaphore id $semid:
es_es: A modo de ejemplo, el siguiente código espera en un semáforo $semnum del semáforo con identificador $semid:

source: They never should have been available with the shorter names, and if you application depends on them, you should (be ashamed and) contact perl5-porters to discuss what are the proper APIs.
es_es: Nunca deberían haber estado disponibles con los nombres más acortados, y si su aplicación depende de ellos, debe (y avergonzarse de ello) contactar con los perl5-porters para discutir cuáles son las API adecuadas.

source: However, it's important that the blocks are the right shape, and that the developer shouldn't have to use a big block when all they need is a small one.
es_es: Sin embargo, es importante que los bloques estén en la forma correcta, y que el desarrollador no debería tener que utilizar un bloque grande cuando todo lo que necesita es uno pequeño.

source: See L<perlipc> for details, and for other examples.
es_es: Ver L<perlipc> para más detalles, y para otros ejemplos.

source: Unlike B<sed>, we use the \<I<digit>> form in only the left hand side.
es_es: A diferencia de B<sed>, utilizamos el formato \<I<dígito>> sólo en el lado izquierdo.

source: Scripts run by the superuser may thus need to do a stat() to determine the actual mode of the file, or temporarily set their effective uid to something else.
es_es: Scripts ejecutados por el superusuario pueden necesitar hacer un stat() para determinar el modo actual del archivo, o temporalmente poner su uid efectivo a otro valor.

source: chomp($line);
es_es: chomp($linea);

source: This allows you to replace parts of the EXPR and return what was there before in one operation, just as you can with splice().
es_es: Esto le permite reemplazar partes de la EXPR y devolver lo que había antes, en una operación, tal como se puede hacer con splice().
